"""Напишите несколько строк кода, выводящих на экран ваше имя и почто-
вый адрес. Адрес напишите в формате, принятом в вашей стране. Ника-
кого ввода от пользователя ваша первая программа принимать не будет,
только вывод на экран и больше ничего."""

print('Сергей,')
print('Донской Государственный технический университет')
print('пл. Гагарина, 1, Ростов-на-Дону, Ростовская обл., 344000')

